Repository: mozilla-l10n/mt-training-data
Catalog: hux/hux_pontoon.tmx
Source language: en_us
Languages: hux

source: About
hux: Bue ie

source: Add information
hux: Llogakɨno emodo dane llono

source: Approve
hux: Fɨnoka

source: Cancel Submission
hux: Oreka oreñeno

source: Click
hux: Klik

source: Comment
hux: Ñɨaɨnɨaɨ dane abvdo kaɨ ñaɨno

source: Contact Us
hux: Kaɨna uaido

source: Continue
hux: Fɨnokana jaɨ

source: Contribute
hux: Kano

source: Different language
hux: Jɨaɨe uainɨaɨ

source: Donate your voice
hux: Oo uai kuemo ine

source: Guidelines
hux: Lluaisoi

source: Healthcare
hux: Irafueni

source: I do not agree
hux: Kuemona marañede

source: Languages
hux: Uainɨaɨ

source: Listen
hux: Kakarei

source: Log In / Sign Up
hux: Fo jai

source: N
hux: G

source: Nature and Environment
hux: Komuilla jasikɨ noto

source: No
hux: Nia

source: No thanks, continue speaking
hux: Mare,ñaɨno ñaɨno

source: p
hux: r

source: r
hux: g

source: Reject
hux: Gaɨñede

source: Report
hux: Llollena

source: Return
hux: Erónetde

source: Review
hux: Eroi

source: Review Sentences
hux: Ñaɨa uainɨaɨ eruaɨ

source: Review sentences in your language
hux: Ñaɨa uainɨaɨ eruaɨ

source: Review & Submit
hux: Jɨbuillano ore

source: s
hux: e

source: S
hux: E

source: Sentence
hux: Ñaɨanɨaɨ

source: Skip
hux: Equiedo jaide

source: Speak
hux: Uritde

source: Speak now
hux: Mai uritde

source: Start recording
hux: Taɨne

source: Submit
hux: Ore

source: Tap
hux: Feto

source: Write
hux: Kueno

source: y
hux: j

source: Y
hux: F

source: Yes
hux: Ji
